backend/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: 'Warm up'
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp up load'
    - duration: 60
      arrivalRate: 50
      name: 'Sustained load'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Health check'
    weight: 1
    flow:
      - get:
          url: '/api/health'

  - name: 'Get exercises list'
    weight: 3
    flow:
      - get:
          url: '/api/exercises?page=1&limit=20'

  - name: 'Get routines list'
    weight: 2
    flow:
      - get:
          url: '/api/routines?page=1&limit=10'

  - name: 'Get membership types'
    weight: 2
    flow:
      - get:
          url: '/api/membership-types'

  - name: 'Get dashboard financial'
    weight: 1
    flow:
      - get:
          url: '/api/dashboard/financial'